
########################################################################################################################
# 라이브러리 선언                                                                                   
########################################################################################################################
import sqlite3
from sqlalchemy import create_engine
import os

########################################################################################################################
# DB 연결 Class                                                                               
########################################################################################################################
class dbConnect():
    
    def dbConn(self, db_dir):

        # sqlite3 연결
        conn = sqlite3.connect(db_dir, isolation_level=None)
        cur = conn.cursor()

        # SQLAlchemy 연결
        engine = create_engine(f"sqlite:///{db_dir}")
        conn2 = engine.connect()
        
        return (cur, conn, conn2)
        